The IP information is to be assigned to a switch SVI (switch virtual interface)

SWITCHH

Switch›enable
Switch#cenfigure terminal

Switch(config)#hostname MIS-SW1
MIS SW1 (config)#interface vlan 1 


MIS-SW1 (config-if)#ip address 192.168.1.3 255.255.255.0
MIS-SW1 (config-if)#no shutdown
MIS-SW1(config-if)#
%LINK-5-CHANGED: Interface Vlan, changed state to up
%LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan, changed state to up MIS-SWI 

(config-if)#exit
MIS-SW1(config)#ip default-gateway 192.168.1.1
MIS-SW1 (config)#exit


ROUTERRR

Router›enable
Router#configure terminal

Router (config)#hostname SERVER-R1
SERVER-R1 (config)#interface fastEtherneto/0
SERVER-R1 (config-if)#ip address 192.168.1.1 255.255.255.0
SERVER-R1 (config-if)#no shutdown
SERVER-R1(config-if)#
%LINK-5-CHANGED: Interface FastEthernete/0,
changed state to up
%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up
SERVER R1 (config-if)#exit
SERVER-R1 (config)#exit
SERVER-R1#exit

SERVER-R1 >enable
SERVER-R1#configure terminal

SERVER-R1(config)#line console 0
SERVER-R1 (config-line)#password 123 ‹- enable configuration of console access and using console cable to PC or Laptop

SERVER-R1 (config-line)#login
SERVER-R1 (config-line)#exit

SERVER-R1(config)#enable password 123 <-- enable configuration of privileged mode secured
SERVER-R1 (config)#exit

SERVER-R#configure terminal

SERVER-R1 (config)#banner motd $ <--- delimiting character to enable banner message
Enter TEXT message.
End with the character '$'.
=========-Authorized User Only|=====-====
$
SERVER R1 (config)#exit
SERVER-R1#config terminal


SERVER-R1 (config)#line vty 0 15
SERVER-R1 (config-line)#password 123 <-..- enable configuration of TELNET access using PC or Laptop
SERVER-R1 (config-line)#login
SERVER-R1 (config-line)#exit
SERVER-R1 (config)#exit
SERVER-R1#config terminal
SERVER-R1 (config)#service password-encryption <-- password is encrypted try to check using show running-config command



SHH

SERVER-R1 (config)#ip domain name sample.com
SERVER- R1 (config)#crypto key generate rsa


How many bits in the modulus [512]: 1024

SERVER-R1 (config)#ip ssh version 2

SERVER-R1 (config)#username SERVER-R1 secret 123
SERVER-R1 (config)#enable secret 123
SERVER-R1 (config)#line vty 0 15
SERVER-R1 (config-line)#transport input ssh
SERVER- R1 (config-line)#login local
SERVER-R1 (config-line)#exit
SERVER-R1 (config)#exit
SERVER-R1#exit